<template>
  <timeline timeline-theme="#1989fa" timeline-bg="#1989fa">
    <timeline-title font-color="#1989fa">
      <el-card>
        <p>漫威电影宇宙（MCU）时间线</p>
      </el-card>
    </timeline-title>
    <timeline-item bg-color="#9dd8e0" v-for="(item,index) in timelineData" :key="index">
      <div class="timeline-content">
        <el-tag hit>{{item.time}}{{item.name}}</el-tag>
        <el-card>
          <p>{{item.content}}</p>
        </el-card>
      </div>
    </timeline-item>
  </timeline>
</template>

<script>
  import {
    Timeline,
    TimelineItem,
    TimelineTitle
  } from 'vue-cute-timeline'
  export default {
    components: {
      Timeline,
      TimelineItem,
      TimelineTitle
    },
    data() {
      return {
        timelineData: [{
            time: '2008年',
            name: '《钢铁侠》',
            content: '开启漫威电影宇宙大门的关键，漫威在2008年时遭遇窘境，孤注一掷拍了《钢铁侠》，而所有的故事就从这里开始。彩蛋补充：神盾局长告诉托尼，你不是世界上唯一的超级英雄。'
          },
          {
            time: '2008年',
            name: '《无敌浩克》',
            content: '无敌浩克的影响力并不是很大，甚至大多数观众印象中的绿巨人浩克仍是由导演李安执导的于2003年上映的《绿巨人浩克》，但该部电影上映，显示漫威对电影宇宙完整性所表达的决心。彩蛋补充：钢铁侠主动找到罗斯将军，暗示浩克应该加入他（复仇者联盟）。'
          },
          {
            time: '2010年',
            name: '《钢铁侠2》',
            content: '两年后漫威再度推出第二部钢铁侠电影，同时也加入新的英雄角色“战争机器”，让钢铁装市场也跟着打开了，使钢铁侠这位超级英雄对漫威而言，分量又更加的加重了。彩蛋补充：神盾局的菲尔在野外发现了雷神之锤，暗示了接下来的电影《雷神》。'
          },
          {
            time: '2011年',
            name: '《雷神》',
            content: '自《钢铁侠2》上映一年后，第三位漫威电影宇宙登场的超级英雄。内容讲述了索尔的经历，让观众对索尔有初步的了解，其中的喜剧元素也明显多于前三部。彩蛋补充：出现了宇宙魔方和他的弟弟洛基。'
          },
          {
            time: '2011年',
            name: '《美国队长》',
            content: '与《雷神》同年上映，看似没有超能力的超级英雄。故事的时代背景设定在二战时期，可惜当时口碑不如预期，对于漫威电影宇宙来说依然是一部很重要的电影。彩蛋补充：美国队长与神盾局长相遇，被直接拉入复仇者联盟。'
          },
          {
            time: '2012年',
            name: '《复仇者联盟》',
            content: '漫威电影最具影响力的作品，一推出就在全球各地狂揽票房。也让热爱电影的观众对一些超级英雄的印象加深，像是钢铁侠、浩克、雷神索尔、美国队长等超级英雄。是漫威电影宇宙开始以来最成功的一部作品。彩蛋补充：灭霸登场，第一阶段结束。'
          },
          {
            time: '2013年',
            name: '《钢铁侠3》',
            content: '如果硬要形容电影的话，只能用一句话“太爽了”。大量钢铁战衣登场，让钢铁迷看完后兴奋不已，是钢铁侠电影系列最为成功、票房最高的电影。彩蛋补充：布鲁斯-班纳登场。'
          },
          {
            time: '2013年',
            name: '《雷神2：黑暗世界》',
            content: '雷神索尔系列的电影，老实说都表现不佳，或许英雄给各位观众的印象还不是特别深（反倒洛基意外高人气）。导致其票房总是低于预期，不过电影风格还是维持一贯的幽默感。彩蛋补充：收藏家登场，为漫威电影打开迈向“宇宙之路”。'
          },
          {
            time: '2014年',
            name: '《美国队长2：冬日战士》',
            content: '剧情中规中矩，加入了新的超级英雄“冬兵”，相比于前作是一个非常有进步的作品。彩蛋补充：快银和绯红女巫登场。'
          },
          {
            time: '2014年',
            name: '《银河护卫队》',
            content: '漫威最为大胆、创新和突破性的一部电影。对各个英雄人物角色的性格描述设定十分完整，虽然登场角色众多，但是却没有让观众感到混乱。彩蛋补充：发现霍华德怪鸭。'
          },
          {
            time: '2015年',
            name: '《复仇者联盟2：奥创纪元》',
            content: '漫威又为观众带来重量级电影，选用了复仇者中最为恐惧的反派奥创，虽然电影相比于漫画在奥创的设定强度不同，被削弱得过多，毕竟电影长度有所限制，按照漫画，也未必是最正确的选择。不得不说对于每位人物的设定相当到位，剧情上的强弱也相对平衡，同时也出现了新的英雄“幻视”（心灵宝石）。彩蛋补充：此时已经准备好无限手套。'
          },
          {
            time: '2015年',
            name: '《蚁人》',
            content: '与《复仇者联盟2：奥创纪元》同年，漫威又推出新的英雄独立电影《蚁人》。被评为漫威电影中值得再次进电影院观赏的电影，剧情高潮迭起，掌握得十分不错。彩蛋补充：美国队长出现，为“英雄内战”的到来点起火苗。'
          },
          {
            time: '2016年',
            name: '《美国队长3：内战》',
            content: '本片规模简直是《复仇者联盟2.5》，尤其是当中40分钟的机场大战，其爽度远远超越了片中美国队长与钢铁侠一对一的对决。彩蛋补充：冬兵被冷冻，美国队长与黑豹交谈，透露了下一部英雄独立电影《黑豹》。'
          },
          {
            time: '2016年',
            name: '《奇异博士》',
            content: '新英雄独立电影《奇异博士》登场，除了超能力也开始带入魔法。中规中矩的英雄独立电影，魔法特效受到了观众的好评。彩蛋补充：奇异博士与索尔交谈，正好对应《雷神3》中的部分内容。'
          },
          {
            time: '2017年',
            name: '《银河护卫队2》',
            content: '维持第一部的风格，虽说票房没有预期好，但也逆转了第一部对某些角色的印象。彩蛋补充：对现阶段的漫威宇宙没有什么影响。'
          },
          {
            time: '2017年',
            name: '《蜘蛛侠：英雄归来》',
            content: '首部蜘蛛侠回归漫威的电影，是漫威和索尼影业合作推出，对于角色的描述更贴近日常生活。当然，钢铁侠在电影中也大大加了不少分。彩蛋补充：片尾出现了蝎子人，表示未来能继续看到蜘蛛侠系列独立电影了。'
          },
          {
            time: '2017年',
            name: '《雷神3：诸神黄昏》',
            content: '这次漫威放弃过往的单色调风格，大胆地在画面上使用了丰富的色彩，并加入更多幽默诙谐的内容，让电影不仅获得口碑，在各方面上来看，都是有所突破的。彩蛋补充：出现了灭霸的飞船，准备迎接《复仇者联盟3：无限战争》的到来。'
          },
          {
            time: '2018年',
            name: '《黑豹》',
            content: '黑豹'
          },
          {
            time: '2018年',
            name: '《复仇者联盟3：无限战争》',
            content: '复仇者联盟3：无限战争'
          },
          {
            time: '2018年',
            name: '《蚁人2：黄蜂女现身》',
            content: '蚁人2：黄蜂女现身'
          },
          {
            time: '2019年',
            name: '《惊奇队长》',
            content: '惊奇队长'
          },
        ],
      }
    }
  }

</script>

<style lang="scss">
  /*漫威时间线*/
  .icon-heart {
    width: 50px;
    height: 50px;
    border-radius: 50%;
  }
  .timeline-title {}

    .timeline-content {
      .el-tag {
        margin-bottom: 10px;
        cursor: pointer;
      }
    }
</style>
